{
  "language": "ru",
  "intro": {
    "hello": "Привет, меня зовут",
    "title": "Михаил Макаров.",
    "subtitle": "Я создаю веб-приложения.",
    "text-1": "Разработчик интерфейсов с 5-летним опытом работы в командах от 2 до 20 человек.",
    "text-2": "Эксперт по реализации пользовательских интерфейсов с опытом создания кастомных UI-компонентов и оптимизации скорости загрузки страниц."
  },
  "about": {
    "text-1": "Я фронтенд-разработчик, создаю удобные интерфейсы, дизайн-системы и оптимизирую производительность. Разрабатывал SPA и SSR-приложения с нуля: собирал требования, проектировал REST API и писал качественный код с тестами. ",
    "text-2": "Я участвовал в переписывании крупных legacy проектов, внедрял надежное тестирование и наставлял младших разработчиков. Также оптимизировал CI/CD и добавлял поддержку нескольких языков. ",
    "text-3": "Мой путь в веб-разработке начался в 2020 году после перехода из области исследований в сфере ",
    "link-1": "кремниевой фотоники",
    "text-4": ". Я освоил базовые технологии фронтенд разработки: HTML, CSS и JS на интенсивном курсе от ",
    "link-2": "Яндекса и МФТИ",
    "text-5": ". С тех пор я увлёкся PWA приложениями и доступом к аппаратным возможнотям устройств из браузера.",
    "text-6": "Ниже представлены ключевые технологии, с которыми мне приходилось работать:"
  },
  "contacts": {
    "text-1": "Я открыт как для предложений работы (особенно с переездом), так и для фриланс заказов. Тем не менее, не стесняйтесь обращаться ко мне и по иным вопросам. Я постараюсь ответить вам как можно быстрее.",
    "mail-link": "Отправить сообщение",
    "tip-message-text": " и перезагрузите страницу, чтобы увидеть себя на карте.",
    "tip-message-link": "Включите геолокацию"
  },
  "timezones": {
    "text-1": "Ваши часы на ",
    "text-2": " впереди",
    "text-3": " позади",
    "text-4": "Вы в одной часовой зоне с Михаилом",
    "text-5": "Ваши часы",
    "text-6": "Часы Михаила",
    "hour": "ч"
  },
  "authorship": {
    "text": "Спроектировано и реализовано Макаровым Михаилом.",
    "link": " Исходный код тут."
  },
  "resume": {
    "title": "Моё резюме",
    "docx": ".docx",
    "pdf": ".pdf"
  }
}